app/Controllers/WMS/Delivery.php

SELECT *
FROM `receiving_stock`
WHERE `branch_code` = 'nj'
ORDER BY `delivery_date` ASC
---
    public function read($branch)
    {
        // Get the table builder for the specified branch
        $builder = $this->db->table('receiving_stock')->where('branch_code', $branch);
        // Query the table and order by delivery_date
        $query = $builder->orderBy('delivery_date', 'ASC')->get();